       01 RE0058RI.
          02 RE0058RIREQ.
             03 VIDTRA               PIC X(36).
             03 VCANAL               PIC X(6).
             03 VSERVIC              PIC X(6).
             03 INR02TOPE            PIC X(2).
             03 INR02USID            PIC X(20).
             03 INR02FACC            PIC X(2).
             03 INR02CNL             PIC X(2).
             03 INR02FPAG            PIC X(1).
             03 INR02TREC            PIC X(2).
             03 INR02RECA            PIC X(20).
             03 INR02TRX             PIC X(20).
             03 INR02FECH            PIC X(20).
             03 INR02UAPR            PIC X(20).
             03 INR02TDR             PIC X(2).
             03 INR02NDOC            PIC X(15).
             03 INR02CCUS            PIC X(9).
             03 INR02NSUM            PIC X(20).
             03 INR02MONE            PIC X(3).
             03 INR02CONV            PIC X(4).
             03 IOR02IDCON           PIC X(20).
             03 IOR02IDPAG           PIC X(20).
             03 IOR02IDOFI           PIC X(4).
             03 INR02IDTRX           PIC X(4).
             03 INR02CAJE            PIC X(10).
             03 INR02NPAG            PIC X(6).
             03 INR02CPAG            PIC X(6).
             03 IOR02TOTRE           PIC X(10).
             03 IOR02NROPA           PIC X(6).
             03 INR03NRRE            PIC X(30).
             03 INR03REMO            PIC X(3).
             03 INR03FEMI            PIC X(8).
             03 INR03FVEN            PIC X(8).
             03 INR03MONT            PIC X(15).
             03 INR03MMIN            PIC X(15).
             03 INR03COMI            PIC X(15).
             03 INR03MRED            PIC X(15).
             03 INR03MMOR            PIC X(15).
             03 INR03MTOT            PIC X(15).
             03 INR03DMOR            PIC X(10).
             03 INR03DOBS            PIC X(100).
             03 INR03DCLA            PIC X(4).
             03 INR03DANT            PIC X(4).
             03 INR03DEST            PIC X(10).
             03 INR03EFIL1           PIC X(30).
             03 INR03EFIL2           PIC X(13).
             03 INR03EFIL3           PIC X(60).
             03 INR03EFIL4           PIC X(12).
             03 INR03EFIL5           PIC X(100).
             03 INR03EFIL6           PIC X(9).
             03 INR03TOTRE           PIC X(10).
             03 INR03NROPA           PIC X(6).
             03 INR04NOMB            PIC X(60).
             03 INR04APPAT           PIC X(60).
             03 INR04APMAT           PIC X(60).
             03 INR04DCLA            PIC X(4).
             03 INR04DOBS            PIC X(100).
             03 INR04DFIL1           PIC X(30).
             03 INR04DFIL2           PIC X(13).
             03 INR04DFIL3           PIC X(60).
             03 INR04DFIL4           PIC X(13).
             03 INR04DFIL5           PIC X(100).
             03 INR04DFIL6           PIC X(9).
             03 INR05CANT            PIC X(5).
             03 INR05AGRP            PIC X(1).
             03 INR05TIPAG           PIC X(20).
             03 INR05IMPAG           PIC X(20).
             03 INR05MPAG            PIC X(20).
             03 INR05NCUO            PIC X(2).
             03 INR05TICHQ           PIC X(2).
             03 INR05TIDCH           PIC X(4).
             03 INR05CHDIA           PIC X(2).
             03 INR05CHBCO           PIC X(3).
             03 INR05CHCTA           PIC X(20).
             03 INR05CHNRO           PIC X(12).
             03 INR05CLIIB           PIC X(9).
             03 INR05CORED           PIC X(10).
             03 INR05TXRED           PIC X(6).
             03 INR05DESRE           PIC X(60).
             03 INR05TERMI           PIC X(15).
             03 INR05TRACE           PIC X(15).
             03 INR05AUTO            PIC X(15).
             03 INR05UBITE           PIC X(100).
             03 INR05DFIL1           PIC X(30).
             03 INR05DFIL2           PIC X(13).
             03 INR05DFIL3           PIC X(60).
             03 INR05DFIL4           PIC X(13).
             03 INR05DFIL5           PIC X(100).
             03 INR05DFIL6           PIC X(9).
          02 RE0058RIRSP.
             03 OVTRX                PIC X(36).
             03 OTIMEST              PIC X(18).
             03 OUR02TOPE            PIC X(2).
             03 OUR02USID            PIC X(20).
             03 OUR02FACC            PIC X(2).
             03 OUR02CNL             PIC X(2).
             03 OUR02FPAG            PIC X(1).
             03 OUR02TREC            PIC X(2).
             03 OUR02RECA            PIC X(20).
             03 OUR02TRX             PIC X(20).
             03 OUR02FECH            PIC X(20).
             03 OUR02TDR             PIC X(2).
             03 OUR02NDOC            PIC X(15).
             03 OUR02CCUS            PIC X(9).
             03 OUR02NSUM            PIC X(20).
             03 OUR02MONE            PIC X(3).
             03 OUR02CONV            PIC X(4).
             03 OUR02IDCLT           PIC X(20).
             03 OUR02IDCON           PIC X(20).
             03 OUR02IDPAG           PIC X(20).
             03 OUR02IDOFI           PIC X(4).
             03 OUR02IDTRX           PIC X(4).
             03 OUR02CAJE            PIC X(10).
             03 OUR02NPAG            PIC X(6).
             03 OUR02CPAG            PIC X(6).
             03 OUR02TOTRE           PIC X(10).
             03 OUR02NROPA           PIC X(6).
             03 OUR03NRRE            PIC X(30).
             03 OUR03REMO            PIC X(3).
             03 OUR03FEMI            PIC X(8).
             03 OUR03FVEN            PIC X(8).
             03 OUR03MONT            PIC X(15).
             03 OUR03MMIN            PIC X(15).
             03 OUR03COMI            PIC X(15).
             03 OUR03MRED            PIC X(15).
             03 OUR03MMOR            PIC X(15).
             03 OUR03MTOT            PIC X(15).
             03 OUR03DMOR            PIC X(10).
             03 OUR03DOBS            PIC X(100).
             03 OUR03DCLA            PIC X(4).
             03 OUR03DANT            PIC X(4).
             03 OUR03DEST            PIC X(10).
             03 OUR03EFIL1           PIC X(30).
             03 OUR03EFIL2           PIC X(13).
             03 OUR03EFIL3           PIC X(60).
             03 OUR03EFIL4           PIC X(12).
             03 OUR03EFIL5           PIC X(100).
             03 OUR03EFIL6           PIC X(9).
             03 OUR03TOTRE           PIC X(10).
             03 OUR03NROPA           PIC X(6).
             03 OUR04NOMB            PIC X(60).
             03 OUR04APPAT           PIC X(60).
             03 OUR04APMAT           PIC X(60).
             03 OUR04DCLA            PIC X(4).
             03 OUR04DOBS            PIC X(100).
             03 OUR04DFIL1           PIC X(30).
             03 OUR04DFIL2           PIC X(13).
             03 OUR04DFIL3           PIC X(60).
             03 OUR04DFIL4           PIC X(13).
             03 OUR04DFIL5           PIC X(100).
             03 OUR04DFIL6           PIC X(9).
             03 OUR05CANT            PIC X(5).
             03 OUR05AGRP            PIC X(1).
             03 OUR05TIPAG           PIC X(20).
             03 OUR05IMPAG           PIC X(20).
             03 OUR05MPAG            PIC X(20).
             03 OUR05NCUO            PIC X(2).
             03 OUR05TICHQ           PIC X(2).
             03 OUR05TIDCH           PIC X(4).
             03 OUR05CHDIA           PIC X(2).
             03 OUR05CHBCO           PIC X(3).
             03 OUR05CHCTA           PIC X(20).
             03 OUR05CHNRO           PIC X(12).
             03 OUR05CLIIB           PIC X(9).
             03 OUR05CORED           PIC X(10).
             03 OUR05TXRED           PIC X(6).
             03 OUR05DESRE           PIC X(60).
             03 OUR05TERMI           PIC X(15).
             03 OUR05TRACE           PIC X(15).
             03 OUR05AUTO            PIC X(15).
             03 OUR05UBITE           PIC X(100).
             03 OUR05DFIL1           PIC X(30).
             03 OUR05DFIL2           PIC X(13).
             03 OUR05DFIL3           PIC X(60).
             03 OUR05DFIL4           PIC X(13).
             03 OUR05DFIL5           PIC X(100).
             03 OUR05DFIL6           PIC X(9).
          02 ELEERR.
             03 PECODE               PIC X(2).
             03 PERROR               PIC X(4).
             03 PEMNSG               PIC X(70).
             03 PEFLD                PIC X(10).
             03 PEROW                PIC X(4).
             03 PEWF                 PIC X(1).